package com.shyfay.usual;

import com.alibaba.fastjson.JSON;
import com.alibaba.fastjson.JSONArray;

/**
 * @author 牟雪
 * @since 2018/12/18
 */
public class JSONTest {
    public static void main(String[] args){
        String testStr = " [\n" +
                "    {\n" +
                "      \"content_id\": \"2195200\",\n" +
                "      \"title\": \"创新工作方法强化结果运用\",\n" +
                "      \"release_date\": \"2018-12-08\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"2124092\",\n" +
                "      \"title\": \"全省妇联基层组织建设暨乡村振兴巾帼行动现场推进会走进龙马潭\",\n" +
                "      \"release_date\": \"2018-11-25\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"2119601\",\n" +
                "      \"title\": \"中央、省级主流媒体聚焦泸州新经济建设发展情况\",\n" +
                "      \"release_date\": \"2018-11-24\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"2088281\",\n" +
                "      \"title\": \"[庆祝改革开放40年]泸州：一座老牌工业城市的进阶史\",\n" +
                "      \"release_date\": \"2018-11-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"2076319\",\n" +
                "      \"title\": \"中共四川省委农村工作委员会督察组视察合江污水处理厂\",\n" +
                "      \"release_date\": \"2018-11-14\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"2029432\",\n" +
                "      \"title\": \"泸州市审议通过《党政领导干部安全生产责任制实施办法》\",\n" +
                "      \"release_date\": \"2018-11-06\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1987444\",\n" +
                "      \"title\": \"省人大调研泸县畜禽粪污资源化利用工作\",\n" +
                "      \"release_date\": \"2018-10-28\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1978318\",\n" +
                "      \"title\": \"泸州市政协主席会议成员视察泸州市健康城市建设工作\",\n" +
                "      \"release_date\": \"2018-10-26\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1978315\",\n" +
                "      \"title\": \"泸州：好干部是选出来的更是管出来的\",\n" +
                "      \"release_date\": \"2018-10-26\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1978312\",\n" +
                "      \"title\": \"泸州市“企业开办小时清单制度”获肯定\",\n" +
                "      \"release_date\": \"2018-10-26\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1978309\",\n" +
                "      \"title\": \"泸州基层人大代表建言献策为城市发展出谋划策\",\n" +
                "      \"release_date\": \"2018-10-26\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1978306\",\n" +
                "      \"title\": \"泸州举办书画摄影展纪念改革开放四十周年\",\n" +
                "      \"release_date\": \"2018-10-26\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1838839\",\n" +
                "      \"title\": \"四川省委书记彭清华巡视西博会泸州馆\",\n" +
                "      \"release_date\": \"2018-09-26\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1838836\",\n" +
                "      \"title\": \"四川大学与泸州市校地合作工作交流会在成都举行\",\n" +
                "      \"release_date\": \"2018-09-26\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1673736\",\n" +
                "      \"title\": \"泸州市长刘强:把&quot;安全第一&quot;意识装进脑袋里落实在行动中\",\n" +
                "      \"release_date\": \"2018-08-27\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1429979\",\n" +
                "      \"title\": \"王宁：泸州要争创全省经济副中心推动川南经济区一体化发展\",\n" +
                "      \"release_date\": \"2018-07-26\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1408134\",\n" +
                "      \"title\": \"尹力主持召开省政府第二次全体会议\",\n" +
                "      \"release_date\": \"2018-07-24\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1333504\",\n" +
                "      \"title\": \"泸州市人大系统传达贯彻省委十一届三次全会精神\",\n" +
                "      \"release_date\": \"2018-07-14\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1324016\",\n" +
                "      \"title\": \"近年首次！四川启动II级防汛应急响应\",\n" +
                "      \"release_date\": \"2018-07-13\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1324013\",\n" +
                "      \"title\": \"四川启动今年第二轮安全生产综合督查，将重点督查汛期安全生产等七项工作\",\n" +
                "      \"release_date\": \"2018-07-13\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1324010\",\n" +
                "      \"title\": \"学习贯彻省委十一届三次全会精神报告会侧记：一场报告会带来的“三个更加”\",\n" +
                "      \"release_date\": \"2018-07-13\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1298650\",\n" +
                "      \"title\": \"我省组建10个宣讲分团深入各县市区和基层单位宣讲\",\n" +
                "      \"release_date\": \"2018-07-11\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1150341\",\n" +
                "      \"title\": \"[四川日报]保护发展并重写好长江大保护“答卷”\",\n" +
                "      \"release_date\": \"2018-06-22\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1150338\",\n" +
                "      \"title\": \"泸州市公开中央环境保护督察整改方案\",\n" +
                "      \"release_date\": \"2018-06-22\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108449\",\n" +
                "      \"title\": \"泸州市人大常委会视察2018城市重点建设项目推进情况\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108446\",\n" +
                "      \"title\": \"渝昆高铁力争年底开建泸州与重庆的距离将缩短到1个小时\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108443\",\n" +
                "      \"title\": \"泸州市委书记蒋辅义主持召开市委常委（扩大）会议\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108439\",\n" +
                "      \"title\": \"泸州市八届人大常委会举行第十三次会议\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108436\",\n" +
                "      \"title\": \"泸州荣获全国首批“守信激励创新奖”\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108429\",\n" +
                "      \"title\": \"泸州市成功创建省级农产品质量安全监管示范市\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108425\",\n" +
                "      \"title\": \"泸州市政府与绿地集团白酒产业战略合作座谈会召开\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108422\",\n" +
                "      \"title\": \"泸州市长刘强主持召开市政府八届39次常务会议\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108419\",\n" +
                "      \"title\": \"到2020年泸州市养老服务市场将全面开放\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108416\",\n" +
                "      \"title\": \"依托白酒文化泸州市打造世界级旅游名片\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108413\",\n" +
                "      \"title\": \"泸州市举行余芬同志先进事迹宣讲报告会\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108410\",\n" +
                "      \"title\": \"浙江赴四川泸州片扶贫协作挂职干部举行第2次全体成员会议\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108404\",\n" +
                "      \"title\": \"泸州市长刘强：牢固树立“绿水青山就是金山银山”理念\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108401\",\n" +
                "      \"title\": \"[四川日报]泸州：建设现代化区域中心建成全国美丽城市\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108398\",\n" +
                "      \"title\": \"[聚焦泸州云龙机场建设]试飞在即6月中旬将开展生产用房和民航站坪工程竣工验收\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108389\",\n" +
                "      \"title\": \"2018年泸州十项民生工程及20件民生实事正有序推进\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108385\",\n" +
                "      \"title\": \"破解执行难泸州已执行到位金额超41亿元\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108381\",\n" +
                "      \"title\": \"蒋辅义：下深水解决问题确保完成“双过半”\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108378\",\n" +
                "      \"title\": \"泸州市长刘强：严格把好污水处理排放监测关\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108374\",\n" +
                "      \"title\": \"国家规划泸州铿锵落子\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108370\",\n" +
                "      \"title\": \"争创全国健康城市示范市泸州市积极推进“十大工程”\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108367\",\n" +
                "      \"title\": \"补贴、激励、编制管理……泸州人才新政出炉\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108364\",\n" +
                "      \"title\": \"泸州召开民营经济发展大会坚定民营经济发展信心\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108359\",\n" +
                "      \"title\": \"市委书记蒋辅义：泸州重点工业项目要确保如期竣工投产\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108353\",\n" +
                "      \"title\": \"泸州：结合实际抓好贯彻落实确保各项任务落地生根\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"content_id\": \"1108345\",\n" +
                "      \"title\": \"省政府高考督查组检查指导我市2018年备考工作\",\n" +
                "      \"release_date\": \"2018-06-19\"\n" +
                "    }\n" +
                "  ]";
        JSONArray jsonArray = JSON.parseArray(testStr);
        System.out.println(jsonArray.size());
    }
}
